a = [
    (
        {
            "prediction_model": "LSTM",
            "explanation_model": "inputGradientExplainer",
            "start_date": "2019-06-01",
            "end_date": "2019-06-15",
            "seq_len": 30,
        },
        {
            "可靠性得分": 0.7792460887972007,
            "稳定性得分": 0.23019926588732342,
            "鲁棒性得分": 0.4088587002370083,
            "透明性得分": 0.0,
            "解释效果得分": 0.0,
        },
    ),
    (
        {
            "prediction_model": "GRU",
            "explanation_model": "inputGradientExplainer",
            "start_date": "2019-06-01",
            "end_date": "2019-06-15",
            "seq_len": 30,
        },
        {
            "可靠性得分": 0.9999999999999999,
            "稳定性得分": 0.558048361598526,
            "鲁棒性得分": 0.0,
            "透明性得分": 0.0,
            "解释效果得分": 0.0,
        },
    ),
    (
        {
            "prediction_model": "MLP",
            "explanation_model": "inputGradientExplainer",
            "start_date": "2019-06-01",
            "end_date": "2019-06-15",
            "seq_len": 30,
        },
        {
            "可 靠性得分": 0.8743617477994924,
            "稳定性得分": 0.5358252008904741,
            "鲁棒性得分": 1.0,
            "透明性得分": 0.0,
            "解释效果得分": 0.0,
        },
    ),
    (
        {
            "prediction_model": "NRSR",
            "explanation_model": "inputGradientExplainer",
            "start_date": "2019-06-01",
            "end_date": "2019-06-15",
            "seq_len": 30,
        },
        {
            "可靠性得分": 0.0,
            "稳定性得分": 0.9999999999999999,
            "鲁棒性得分": 0.00338034509560714,
            "透明性得分": 1.0,
            "解释效果得分": 1.0,
        },
    ),
    (
        {
            "prediction_model": "relation_GATs",
            "explanation_model": "inputGradientExplainer",
            "start_date": "2019-06-01",
            "end_date": "2019-06-15",
            "seq_len": 30,
        },
        {
            "可靠性得分": 0.6618826196514279,
            "稳定性得分": 0.0,
            "鲁棒性得分": 0.04702575636056494,
            "透明性得分": 1.0,
            "解释效果得分": 0.20576075103781344,
        },
    ),
    (
        {
            "prediction_model": "LSTM",
            "explanation_model": "inputGradientExplainer",
            "start_date": "2019-06-01",
            "end_date": "2019-06-15",
            "seq_len": 60,
        },
        {
            "可靠性得分": 0.7792460887972007,
            "稳定性得分": 0.23019926588732342,
            "鲁棒性得分": 0.4088587002370083,
            " 透明性得分": 0.0,
            "解释效果得分": 0.0,
        },
    ),
    (
        {
            "prediction_model": "GRU",
            "explanation_model": "inputGradientExplainer",
            "start_date": "2019-06-01",
            "end_date": "2019-06-15",
            "seq_len": 60,
        },
        {
            "可靠性得分": 0.9999999999999999,
            "稳定性得分": 0.558048361598526,
            "鲁棒性得分": 0.0,
            "透明性得分": 0.0,
            "解释效果得分": 0.0,
        },
    ),
    (
        {
            "prediction_model": "MLP",
            "explanation_model": "inputGradientExplainer",
            "start_date": "2019-06-01",
            "end_date": "2019-06-15",
            "seq_len": 60,
        },
        {
            "可靠性得分": 0.8743617477994924,
            "稳定性得分": 0.5358252008904741,
            "鲁棒性得分": 1.0,
            "透明性得分": 0.0,
            "解释效果得分": 0.0,
        },
    ),
    (
        {
            "prediction_model": "NRSR",
            "explanation_model": "inputGradientExplainer",
            "start_date": "2019-06-01",
            "end_date": "2019-06-15",
            "seq_len": 60,
        },
        {
            "可靠性得分": 0.0,
            "稳定性得分": 0.9999999999999999,
            "鲁棒性得分": 0.00338034509560714,
            "透明性得分": 1.0,
            "解释效果得分": 1.0,
        },
    ),
    (
        {
            "prediction_model": "relation_GATs",
            "explanation_model": "inputGradientExplainer",
            "start_date": "2019-06-01",
            "end_date": "2019-06-15",
            "seq_len": 60,
        },
        {
            "可靠性得分": 0.6618826196514279,
            "稳定性得分": 0.0,
            "鲁棒性得分": 0.04702575636056494,
            "透明性得分": 1.0,
            "解释效果得分": 0.20576075103781344,
        },
    ),
]

stock = ["002460.SZ", "600703.SH", "300072.SZ"]

b = [
    (
        {
            "select_dict": {"002460.SZ": 3},
            "return_preference": 0,
            "seq_len": 90,
            "start_date": "20190601",
            "end_date": "20190615",
        },
        {
            "用户收益偏好得分": 0.0,
            "用户风险偏好得分": 0.0,
            "用户投资体验感得分": 1.0,
            "沪深300指数比较得分": 0.0,
            "中证500指数比较得分": 0.0,
            "基准比较得分": 0.0,
            "同行业股票比较对比得分": 0.0,
        },
    ),
    (
        {
            "select_dict": {"600009.SH": 1},
            "return_preference": 0,
            "seq_len": 90,
            "start_date": "20190601",
            "end_date": "20190615",
        },
        {
            "用户收益偏好得分": 0.707718714340043,
            "用户风险偏好得分": 0.9574665744137745,
            "用户投资体验感得分": 1.0,
            "沪深300指数比较得分": 0.5827729302491549,
            "中证500指 数比较得分": 0.5949915568244181,
            "基准比较得分": 0.21022705227788202,
            "同行业股票比较对比得分": 0.6715549818256178,
        },
    ),
    (
        {
            "select_dict": {"600000.SH": 100},
            "return_preference": 0,
            "seq_len": 90,
            "start_date": "20190601",
            "end_date": "20190615",
        },
        {
            "用户收益偏好得分": 1.0,
            "用户风险偏好得分": 0.0,
            "用户投资体验感得分": 0.0,
            "沪深300指数比较得分": 1.0,
            "中证500 指数比较得分": 0.9999999999999999,
            "基准比较得分": 1.0,
            "同行业股票比较对比得分": 1.0,
        },
    ),
    (
        {
            "select_dict": {"600015.SH": 1},
            "return_preference": 0,
            "seq_len": 90,
            "start_date": "20190601",
            "end_date": "20190615",
        },
        {
            "用户收益偏好得分": 0.5437831689642841,
            "用户风险偏好得分": 1.0,
            "用户投资体验感得分": 1.0,
            "沪深300指数比较得分": 0.5015445301324437,
            "中证500指数比较得分": 0.542660384272348,
            "基准比较得分": 0.16961341137725003,
            "同行业股票比较对比得分": 1.0,
        },
    ),
    (
        {
            "select_dict": {"600703.SH": 1},
            "return_preference": 0,
            "seq_len": 90,
            "start_date": "20190601",
            "end_date": "20190615",
        },
        {
            "用户收益偏 好得分": 0.0,
            "用户风险偏好得分": 0.8738174552181767,
            "用户投资体验感得分": 1.0,
            "沪深300指数比较得分": 0.0,
            "中证500指 数比较得分": 0.4604815234861957,
            "基准比较得分": 0.0,
            "同行业股票比较对比得分": 0.6715549818256178,
        },
    ),
    (
        {
            "select_dict": {"300072.SZ": 1},
            "return_preference": 0,
            "seq_len": 90,
            "start_date": "20190601",
            "end_date": "20190615",
        },
        {
            "用户收益偏 好得分": 0.0,
            "用户风险偏好得分": 0.9408411863089929,
            "用户投资体验感得分": 1.0,
            "沪深300指数比较得分": 0.0,
            "中证500指 数比较得分": 0.41763015816850213,
            "基准比较得分": 0.12766255278355176,
            "同行业股票比较对比得分": 1.0,
        },
    ),
]
